blog/23.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 3.1 Assignment and Local State
#+subtitle: 2023-11-15 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)

The third chapter of SICP is entitled /Modularity, Objects, and State/
and is said to be investigating ``two prominent organizational
strategies arising from two rather different ``world views'' of the
structure of systems''. The first one of those strategies focuses on
/objects/. The second one on /streams/. Those two approaches are said
to raise ``significant linguistic issues'' in programming.

* 3.1 Assignment and Local State
~Set!~ is introduced. That is to say, /assignment/ is introduced.

#+begin_quote
Combining ~set!~ with local variables is the general programming
technique we will use for constructing computational objects with
local state. (p. 222)
#+end_quote

On the one hand, introducing assignment has some benefits.
#+begin_quote
[V]iewing systems as collections of objects with local state is a
powerful technique for maintaining a modular design. (p. 225)
#+end_quote

On the other hand, introducing assignment has some costs. In
particular, what we have called `substitution model' ceases to be
adequate model anymore.

* Exercise 3.1
*Exercise*:

#+begin_quote
An /accumulator/ is a procedure that is called repeatedly with a
single numeric argument and accumulates its arguments into a sum.
Each time it is called, it returns the currently accumulated sum.
Write a procedure ~make-accumulator~ that generates accumulators, each
maintaining an independent sum.  The input to ~make-accumulator~
should specify the initial value of the sum; for example

#+begin_src scheme
  (define A (make-accumulator 5))

  (A 10)
  15

  (A 10)
  25
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-accumulator initial)
    (lambda (val)
      (begin (set! initial (+ val initial))
             initial)))

  (define A (make-accumulator 5))
  (A 10) ;; => 15
  (A 10) ;; => 25

  (define B (make-accumulator 938))
  (B 1) ;; => 939
  (B 2) ;; => 941
#+end_src
* Exercise 3.2
*Exercise*:

#+begin_quote
In software-testing applications, it is useful to be able to count the
number of times a given procedure is called during the course of a
computation.  Write a procedure `make-monitored' that takes as input a
procedure, ~f~, that itself takes one input.  The result returned by
~make-monitored~ is a third procedure, say ~mf~, that keeps track of
the number of times it has been called by maintaining an internal
counter.  If the input to ~mf~ is the special symbol
~how-many-calls?~, then ~mf~ returns the value of the counter.  If the
input is the special symbol ~reset-count~, then ~mf~ resets the
counter to zero.  For any other input, ~mf~ returns the result of
calling ~f~ on that input and increments the counter.  For instance,
we could make a monitored version of the ~sqrt~ procedure:

#+begin_src scheme
  (define s (make-monitored sqrt))

  (s 100)
  10

  (s 'how-many-calls?)
  1
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-monitored f)
    (let ((counter 0))
      (lambda (x)
        (cond ((eq? x 'how-many-calls?) counter)
              ((eq? x 'reset-count) (set! counter 0))
              (else (begin (set! counter (+ counter 1))
                           (f x)))))))

  (define s (make-monitored sqrt))

  (s 100) ;; => 10

  (s 'how-many-calls?) ;; => 1
#+end_src
* Exercise 3.3
*Exercise*:

#+begin_quote
Modify the ~make-account~ procedure so that it creates
password-protected accounts.  That is, ~make-account~ should take a
symbol as an additional argument, as in

#+begin_src scheme
  (define acc (make-account 100 'secret-password))
#+end_src

The resulting account object should process a request only if it
is accompanied by the password with which the account was created,
and should otherwise return a complaint:

#+begin_src scheme
  ((acc 'secret-password 'withdraw) 40)
  60

  ((acc 'some-other-password 'deposit) 50)
  "Incorrect password"
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-account balance pwd)
    (define (withdraw amount)
      (if (>= balance amount)
          (begin (set! balance (- balance amount))
                 balance)
          "Insufficient funds"))
    (define (deposit amount)
      (set! balance (+ balance amount))
      balance)
    (define (dispatch p m)
      (cond ((not (eq? p pwd)) (lambda (a) "Incorrect password"))
            ((eq? m 'withdraw) withdraw)
            ((eq? m 'deposit) deposit)
            (else (error "Unknown request -- MAKE-ACCOUNT"
                         m))))
    dispatch)

  (define acc (make-account 100 'foo))

  ((acc 'foo 'withdraw) 40) ;; => 60

  ((acc 'bar 'withdraw) 40) ;; => "Incorrect password"
#+end_src
