blog/23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-30 Thu 21:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 3.1 Assignment and Local State</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 3.1 Assignment and Local State
<br />
<span class="subtitle">2023-11-15 Wed</span>
</h1>
<p>
The third chapter of SICP is entitled <i>Modularity, Objects, and State</i>
and is said to be investigating ``two prominent organizational
strategies arising from two rather different ``world views'' of the
structure of systems''. The first one of those strategies focuses on
<i>objects</i>. The second one on <i>streams</i>. Those two approaches are said
to raise ``significant linguistic issues'' in programming.
</p>

<div id="outline-container-org2b46bc9" class="outline-2">
<h2 id="org2b46bc9">3.1 Assignment and Local State</h2>
<div class="outline-text-2" id="text-org2b46bc9">
<p>
<code>Set!</code> is introduced. That is to say, <i>assignment</i> is introduced.
</p>

<blockquote>
<p>
Combining <code>set!</code> with local variables is the general programming
technique we will use for constructing computational objects with
local state. (p. 222)
</p>
</blockquote>

<p>
On the one hand, introducing assignment has some benefits.
</p>
<blockquote>
<p>
[V]iewing systems as collections of objects with local state is a
powerful technique for maintaining a modular design. (p. 225)
</p>
</blockquote>

<p>
On the other hand, introducing assignment has some costs. In
particular, what we have called `substitution model' ceases to be
adequate model anymore.
</p>
</div>
</div>

<div id="outline-container-org5cffb06" class="outline-2">
<h2 id="org5cffb06">Exercise 3.1</h2>
<div class="outline-text-2" id="text-org5cffb06">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
An <i>accumulator</i> is a procedure that is called repeatedly with a
single numeric argument and accumulates its arguments into a sum.
Each time it is called, it returns the currently accumulated sum.
Write a procedure <code>make-accumulator</code> that generates accumulators, each
maintaining an independent sum.  The input to <code>make-accumulator</code>
should specify the initial value of the sum; for example
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">A</span> (make-accumulator 5))

(A 10)
15

(A 10)
25
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-accumulator</span> initial)
  (<span style="color: #531ab6;">lambda</span> (val)
    (<span style="color: #531ab6;">begin</span> (set! initial (+ val initial))
           initial)))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">A</span> (make-accumulator 5))
(A 10) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 15</span>
(A 10) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 25</span>

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">B</span> (make-accumulator 938))
(B 1) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 939</span>
(B 2) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 941</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org68d3110" class="outline-2">
<h2 id="org68d3110">Exercise 3.2</h2>
<div class="outline-text-2" id="text-org68d3110">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In software-testing applications, it is useful to be able to count the
number of times a given procedure is called during the course of a
computation.  Write a procedure `make-monitored' that takes as input a
procedure, <code>f</code>, that itself takes one input.  The result returned by
<code>make-monitored</code> is a third procedure, say <code>mf</code>, that keeps track of
the number of times it has been called by maintaining an internal
counter.  If the input to <code>mf</code> is the special symbol
<code>how-many-calls?</code>, then <code>mf</code> returns the value of the counter.  If the
input is the special symbol <code>reset-count</code>, then <code>mf</code> resets the
counter to zero.  For any other input, <code>mf</code> returns the result of
calling <code>f</code> on that input and increments the counter.  For instance,
we could make a monitored version of the <code>sqrt</code> procedure:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">s</span> (make-monitored sqrt))

(s 100)
10

(s 'how-many-calls?)
1
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-monitored</span> f)
  (<span style="color: #531ab6;">let</span> ((counter 0))
    (<span style="color: #531ab6;">lambda</span> (x)
      (<span style="color: #531ab6;">cond</span> ((eq? x 'how-many-calls?) counter)
            ((eq? x 'reset-count) (set! counter 0))
            (<span style="color: #531ab6;">else</span> (<span style="color: #531ab6;">begin</span> (set! counter (+ counter 1))
                         (f x)))))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">s</span> (make-monitored sqrt))

(s 100) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 10</span>

(s 'how-many-calls?) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 1</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bdada7" class="outline-2">
<h2 id="org1bdada7">Exercise 3.3</h2>
<div class="outline-text-2" id="text-org1bdada7">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the <code>make-account</code> procedure so that it creates
password-protected accounts.  That is, <code>make-account</code> should take a
symbol as an additional argument, as in
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">acc</span> (make-account 100 'secret-password))
</pre>
</div>

<p>
The resulting account object should process a request only if it
is accompanied by the password with which the account was created,
and should otherwise return a complaint:
</p>

<div class="org-src-container">
<pre class="src src-scheme">((acc 'secret-password 'withdraw) 40)
60

((acc 'some-other-password 'deposit) 50)
<span style="color: #3548cf;">"Incorrect password"</span>
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-account</span> balance pwd)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">withdraw</span> amount)
    (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
        (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #3548cf;">"Insufficient funds"</span>))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> p m)
    (<span style="color: #531ab6;">cond</span> ((not (eq? p pwd)) (<span style="color: #531ab6;">lambda</span> (a) <span style="color: #3548cf;">"Incorrect password"</span>))
          ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                       m))))
  dispatch)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">acc</span> (make-account 100 'foo))

((acc 'foo 'withdraw) 40) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 60</span>

((acc 'bar 'withdraw) 40) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
</pre>
</div>
</div>
</div>
