blog/23.org
* Exercise 3.4
*Exercise*:

#+begin_quote
Modify the ~make-account~ procedure of Exercise 3-3 by adding another
local state variable so that, if an account is accessed more than
seven consecutive times with an incorrect password, it invokes the
procedure ~call-the-cops~.
#+end_quote

*Answer*:

#+begin_src scheme
(define (call-the-cops)
  "Calling the cops!")

(define (make-account balance pwd)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
  (let ((counter 0))
    (define (dispatch p m)
      (if (not (eq? p pwd))
          (begin (set! counter (+ counter 1))
                 (cond ((> counter 7)
                        (call-the-cops)
                        (lambda (a) "We called the cops"))
                       (else (lambda (a) "Incorrect password"))))
          (begin (set! counter 0)
                 (cond ((eq? m 'withdraw) withdraw)
                       ((eq? m 'deposit) deposit)
                       (else (error "Unknown request -- MAKE-ACCOUNT"
                                    m))))))
    dispatch))

(define acc (make-account 100 'foo))
((acc 'foo 'withdraw) 59) ;; => 41
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "Incorrect password"
((acc 'fo 'withdraw) 59) ;; => "We called the cops"
((acc 'fo 'withdraw) 59) ;; => "We called the cops"
((acc 'fo 'withdraw) 59) ;; => "We called the cops"
((acc 'foo 'withdraw) 40) ;; => 1
#+end_src

* Exercise 3.6
*Exercise*:

#+begin_quote
It is useful to be able to reset a random-number generator to produce
a sequence starting from a given value.  Design a new ~rand~ procedure
that is called with an argument that is either the symbol ~generate~
or the symbol ~reset~ and behaves as follows: ~(rand 'generate)~
produces a new random number; ~((rand 'reset) <NEW-VALUE>)~ resets the
internal state variable to the designated <NEW-VALUE>.  Thus, by
resetting the state, one can generate repeatable sequences.  These are
very handy to have when testing and debugging programs that use random
numbers.
#+end_quote

*Answer*:

#+begin_src scheme
  ;; mock rand-update
  (define (rand-update x)
    (+ x 1))

  (define random-init 1)

  (define rand
    (let ((val random-init))
      (lambda (s)
        (cond ((eq? s 'generate)
               (set! val (rand-update val))
               val)
              ((eq? s 'reset)
               (lambda (new-val) (set! val new-val)))
              (else (error "Unknown symbol"))))))

  (rand 'generate) ;; => 2
  (rand 'generate) ;; => 3
  (rand 'generate) ;; => 4
  (rand 'generate) ;; => 5
  ((rand 'reset) 15)
  (rand 'generate) ;; => 16
  (rand 'generate) ;; => 17
  (rand 'generate) ;; => 18
  (rand 'generate) ;; => 19
#+end_src

* Exercise 3.7
*Exercise*:

#+begin_quote
Consider the bank account objects created by ~make-account~, with the
password modification described in Exercise 3-3.  Suppose that our
banking system requires the ability to make joint accounts.  Define a
procedure ~make-joint~ that accomplishes this.  ~Make-joint~ should
take three arguments.  The first is a password-protected account.  The
second argument must match the password with which the account was
defined in order for the ~make-joint~ operation to proceed.  The third
argument is a new password.  ~Make-joint~ is to create an additional
access to the original account using the new password.  For example,
if ~peter-acc~ is a bank account with password ~open-sesame~, then

#+begin_src scheme
  (define paul-acc
    (make-joint peter-acc 'open-sesame 'rosebud))
#+end_src

will allow one to make transactions on ~peter-acc~ using the name
~paul-acc~ and the password ~rosebud~.  You may wish to modify your
solution to *Note Exercise 3-3 to accommodate this new feature.
#+end_quote

*Answer*:

#+begin_src scheme
  ;; So:
  ;;(make-joint peter-acc 'open-sesame 'rosebud)
  ;;             |
  ;;        evaluates to
  ;;             |
  ;;             V
  ;;          joint-acc
  ;;
  ;;          such that
  ;;
  ;;       (joint-acc 'rosebud 'withdraw)
  ;;
  ;; will perform the same operation performed by
  ;;
  ;;       (peter-acc 'open-sesame 'withdraw)


  ;; So, this should work:
  (define (make-joint orig-acc 'orig-pwd 'pwd)
    (define (wrapper p m)
      (if (eq? p pwd)
          (orig-acc 'orig-pwd m)
          (lambda (a) "wrong password")))
    wrapper)
#+end_src

