blog/23.html
<div id="outline-container-orgdc6421f" class="outline-2">
<h2 id="orgdc6421f">Exercise 3.4</h2>
<div class="outline-text-2" id="text-orgdc6421f">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the <code>make-account</code> procedure of Exercise 3-3 by adding another
local state variable so that, if an account is accessed more than
seven consecutive times with an incorrect password, it invokes the
procedure <code>call-the-cops</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">call-the-cops</span>)
  <span style="color: #3548cf;">"Calling the cops!"</span>)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-account</span> balance pwd)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">withdraw</span> amount)
    (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
        (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #3548cf;">"Insufficient funds"</span>))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  (<span style="color: #531ab6;">let</span> ((counter 0))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> p m)
      (<span style="color: #531ab6;">if</span> (not (eq? p pwd))
          (<span style="color: #531ab6;">begin</span> (set! counter (+ counter 1))
                 (<span style="color: #531ab6;">cond</span> ((&gt; counter 7)
                        (call-the-cops)
                        (<span style="color: #531ab6;">lambda</span> (a) <span style="color: #3548cf;">"We called the cops"</span>))
                       (<span style="color: #531ab6;">else</span> (<span style="color: #531ab6;">lambda</span> (a) <span style="color: #3548cf;">"Incorrect password"</span>))))
          (<span style="color: #531ab6;">begin</span> (set! counter 0)
                 (<span style="color: #531ab6;">cond</span> ((eq? m 'withdraw) withdraw)
                       ((eq? m 'deposit) deposit)
                       (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                                    m))))))
    dispatch))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">acc</span> (make-account 100 'foo))
((acc 'foo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 41</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "Incorrect password"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "We called the cops"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "We called the cops"</span>
((acc 'fo 'withdraw) 59) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "We called the cops"</span>
((acc 'foo 'withdraw) 40) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org01370fe" class="outline-2">
<h2 id="org01370fe">Exercise 3.6</h2>
<div class="outline-text-2" id="text-org01370fe">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
It is useful to be able to reset a random-number generator to produce
a sequence starting from a given value.  Design a new <code>rand</code> procedure
that is called with an argument that is either the symbol <code>generate</code>
or the symbol <code>reset</code> and behaves as follows: <code>(rand 'generate)</code>
produces a new random number; <code>((rand 'reset) &lt;NEW-VALUE&gt;)</code> resets the
internal state variable to the designated &lt;NEW-VALUE&gt;.  Thus, by
resetting the state, one can generate repeatable sequences.  These are
very handy to have when testing and debugging programs that use random
numbers.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">mock rand-update</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rand-update</span> x)
  (+ x 1))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">random-init</span> 1)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">rand</span>
  (<span style="color: #531ab6;">let</span> ((val random-init))
    (<span style="color: #531ab6;">lambda</span> (s)
      (<span style="color: #531ab6;">cond</span> ((eq? s 'generate)
             (set! val (rand-update val))
             val)
            ((eq? s 'reset)
             (<span style="color: #531ab6;">lambda</span> (new-val) (set! val new-val)))
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown symbol"</span>))))))

(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 2</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 3</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 4</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 5</span>
((rand 'reset) 15)
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 16</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 17</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 18</span>
(rand 'generate) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 19</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org158d993" class="outline-2">
<h2 id="org158d993">Exercise 3.7</h2>
<div class="outline-text-2" id="text-org158d993">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Consider the bank account objects created by <code>make-account</code>, with the
password modification described in Exercise 3-3.  Suppose that our
banking system requires the ability to make joint accounts.  Define a
procedure <code>make-joint</code> that accomplishes this.  <code>Make-joint</code> should
take three arguments.  The first is a password-protected account.  The
second argument must match the password with which the account was
defined in order for the <code>make-joint</code> operation to proceed.  The third
argument is a new password.  <code>Make-joint</code> is to create an additional
access to the original account using the new password.  For example,
if <code>peter-acc</code> is a bank account with password <code>open-sesame</code>, then
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">paul-acc</span>
  (make-joint peter-acc 'open-sesame 'rosebud))
</pre>
</div>

<p>
will allow one to make transactions on <code>peter-acc</code> using the name
<code>paul-acc</code> and the password <code>rosebud</code>.  You may wish to modify your
solution to *Note Exercise 3-3 to accommodate this new feature.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">So:</span>
<span style="color: #595959;">;;</span><span style="color: #595959;">(make-joint peter-acc 'open-sesame 'rosebud)</span>
<span style="color: #595959;">;;             </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;        </span><span style="color: #595959;">evaluates to</span>
<span style="color: #595959;">;;             </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;             </span><span style="color: #595959;">V</span>
<span style="color: #595959;">;;          </span><span style="color: #595959;">joint-acc</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;;          </span><span style="color: #595959;">such that</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;;       </span><span style="color: #595959;">(joint-acc 'rosebud 'withdraw)</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">will perform the same operation performed by</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;;       </span><span style="color: #595959;">(peter-acc 'open-sesame 'withdraw)</span>


<span style="color: #595959;">;; </span><span style="color: #595959;">So, this should work:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-joint</span> orig-acc 'orig-pwd 'pwd)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">wrapper</span> p m)
    (<span style="color: #531ab6;">if</span> (eq? p pwd)
        (orig-acc 'orig-pwd m)
        (<span style="color: #531ab6;">lambda</span> (a) <span style="color: #3548cf;">"wrong password"</span>)))
  wrapper)
</pre>
</div>
</div>
</div>
