blog/23.html

<div id="outline-container-org13f9653" class="outline-2">
<h2 id="org13f9653">Exercise 3.8</h2>
<div class="outline-text-2" id="text-org13f9653">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
When we defined the evaluation model in section *Note 1-1-3, we said
that the first step in evaluating an expression is to evaluate its
subexpressions.  But we never specified the order in which the
subexpressions should be evaluated (e.g., left to right or right to
left).  When we introduce assignment, the order in which the arguments
to a procedure are evaluated can make a difference to the result.
Define a simple procedure <code>f</code> such that evaluating <code>(+ (f 0) (f 1))</code>
will return 0 if the arguments to <code>+</code> are evaluated from left to right
but will return 1 if the arguments are evaluated from right to left.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">f</span>
  (<span style="color: #531ab6;">let</span> ((to-return 0))
    (<span style="color: #531ab6;">lambda</span> (x)
      (<span style="color: #531ab6;">define</span> <span style="color: #721045;">tmp</span> to-return)
      (set! to-return x)
      tmp)))
</pre>
</div>

<p>
Here I'm using <code>let</code> to establish an environment with a local variable
<code>to-return</code>, bound to the initial value 0. Each time <code>f</code> is applied to
a value foo, <code>f</code> is evaluates to the value currently stored in
<code>to-return</code> and updates the value stored in <code>to-return</code>, by setting it
to foo.
</p>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</span></p>
</div>
</body>
</html>
